{
  "switcherLanguage_el": "ΕΛ",
  "switcherLanguage_en": "EN",
  "nav-home": "αρχική",
  "nav-story": "η ιστορία",
  "nav-backstage": "παρασκήνια",

  "logoAlt": "O Γέρος & ο Φάρος",

  "title-home": "O Γέρος & ο Φάρος",
  "subtitle-home": "Η ιστορία μιας ιστορίας",

  "title-story": "O Γέρος & ο Φάρος",
  "subtitle-story": "Ένα διήγημα, από τη Σοφία Π.",

  "title-backstage": "O Γέρος & ο Φάρος",
  "subtitle-backstage": "Σχετικά με το project",

  "home": "«Ο Γέρος και ο Φάρος» είναι ένα βραβευμένο διήγημα που έγραψε η Σοφία Παπασπύρου για τον «4ο Λογοτεχνικό Διαγωνισμό Ποίησης και Διηγήματος» που διοργανώθηκε από το περιοδικό «Εννεάδα» το 2007. Η σαγηνευτική της αφήγηση της εξασφάλισε το 2ο βραβείο στο Κατηγορία «Διηγήματα».\n\nΣε ένα παραθαλάσσιο χωριό, ένας παλιός φαροφύλακας αντιμετωπίζει την προοπτική να αντικατασταθεί από μια μηχανή. Αυτή η συγκλονιστική ιστορία υπογραμμίζει την αναντικατάστατη φύση της ανθρώπινης συμπόνιας και τον βαθύ αντίκτυπο που μπορεί να έχει μια ζωή μπροστά στην πρόοδο.",

  "story": "Ο ήλιος ξύπνησε από το βραδινό λήθαργό του και σιγά-σιγά έβγαινε από τη θάλασσα βάφοντάς τη χρυσαφιά. Το φως απλωνόταν παντού και οι σκιές έφευγαν με τη σιωπή της νύχτας.\n\nΕπιτέλους ο γέρος μπορούσε να ξεκουραστεί μετά από μια ακόμη νύχτα δουλειάς. Σηκώθηκε με κόπο από την καρέκλα του, βγήκε για λίγο έξω από το φάρο και κοίταξε τη θάλασσα. ≪Τι εγωίστρια που είναι!≫, σκέφτηκε, ≪δε σε αφήνει να δεις τίποτε άλλο μέχρι τον ορίζοντα, εκτός από αυτή!≫\n\nΠραγματικά το λουλακί της αγαπημένης του θάλασσας έφτανε μέχρι εκεί που τα γέρικα μάτια μπορούσαν να δουν, όπου έσμιγε με το γαλανό του ουρανού. Οι ψαράδες επέστρεφαν τραγουδώντας, με τα δίχτυα τους γεμάτα ψάρια· τα κεριά ακόμη έκαιγαν στα πυροφάνια. Οι γυναίκες του χωριού άνοιγαν τα παράθυρα να μυρίσουν τα σπίτια τους ζωή, φως και αλμύρα. Η φύση ολάκερη ξυπνούσε και προμήνυε όμορφη μέρα.\n\nΜα όχι για το γέρο... Κάτι ασυνήθιστο διέκοψε τους συλλογισμούς του: επισκέπτης. Ο δήμαρχος πλησίασε τόσο που σχεδόν η στρογγυλή κοιλιά του τον άγγιξε.\n\n≪Καλημέρα γέρο! Και είναι καλή, μα την αλήθεια! Φέρνω νέα, μάλιστα καλά νέα. Από αύριο μπορείς να ξεκουραστείς. Ναι - ναι! Τελείωσε η δουλειά σου εδώ, θα φέρουμε μηχάνημα που δε χρειάζεται άνθρωπο. Ηλεκτρισμός, γέρο! Το έκαναν ήδη στα δίπλα χωριά και εμείς βέβαια δε θέλουμε να μένουμε πίσω. Όχι βέβαια! Να φύγεις λοιπόν από αύριο, αλλά μην ανησυχείς. Η κυρά-Τασία, ναι-ναι η χήρα, θα σου δώσει το άδειο καλυβάκι στην άκρη του χωριού, να! Εκεί απέναντι. Ωραία λοιπόν! Όλα κανονίστηκαν≫.\n\n≪Εξέλιξης, εξέλιξης!≫ σιγομουρμούριζε χαρούμενα καθώς απομακρυνόταν, αφήνοντας το γέρο με μικρές σταγόνες θάλασσας στα μάτια. Κυλούσαν αργά στα αυλάκια του προσώπου του. Αργά και σταθερά... ήξεραν πια το δρόμο.\n\nΟι σκέψεις έτρεχαν σαν τρελές μέσα στο μυαλό του. Μα πώς γίνεται ο φάρος να μη χρειάζεται άνθρωπο; Ζει η βάρκα χωρίς τον ψαρά; Το σπίτι δίχως ανθρώπους να το ζήσουν; Τι καινούρια μαγικά ήταν αυτά; Γύρισε να κοιτάξει τον φάρο του... να φύγει... Να φύγει από που; Από τη ζωή του; ≪Ένας άνθρωπος είναι πάντα καλύτερος≫, ψιθύρισε. Άρχισε να ανεβαίνει ένα-ένα τα σκαλιά του φάρου και στην κυρτή του ράχη είχε προστεθεί ακόμη ένα φορτίο. Σωριάστηκε κατευθείαν στο σκληρό κρεβάτι του. Η μόνη σωτηρία από τις σκέψεις του: ο ύπνος· ευτυχώς τον λυπήθηκε και ήρθε γρήγορα. Ξημέρωσε Παρασκευή.\n\nΟ δήμαρχος ήρθε από νωρίς και ακολούθησαν έξι-εφτά εργάτες. Μπήκαν βίαια στο φάρο, έσπασαν, άλλαξαν, κουβάλησαν, τοποθέτησαν. Όλα ήταν σχεδόν έτοιμα και ο φάρος θα λειτουργούσε κανονικά από την επόμενη. Το βράδυ δεν περίμεναν πλοία και έτσι κανένας δεν ενοχλήθηκε που για μια νύχτα μετά από τόσο καιρό θα σκοτείνιαζε...\n\nΟ γέρος απόμεινε να περπατάει στην ακρογιαλιά σαν μαριονέτα, δίχως ζωή.\n\nΈφτασε η νυχτιά... στην ώρα της, όπως κάθε μέρα. Η σελήνη γοργά ανέβηκε τη θάλασσα στα μονοπάτια που ο αγαπημένος της περπάτησε το πρωί μα δεν τον πρόλαβε. Έκλαψε πικρά για το χαμό του ήλιου... ποτέ δεν τον προλαβαίνει, μα πάντα τρέχει, πάντα βιάζεται... ίσως μια μέρα... ποιος ξέρει! Τα δάκρυά της σκορπίστηκαν στον ουρανό. Ο γέρος είχε ακούσει κάποτε να τα αποκαλούν αστέρια. Μα γρήγορα τα αστέρια σκεπάστηκαν από σύννεφα, που μαρτυρούσαν άσχημη καλοκαιρινή μπόρα. Ο άνεμος το κατάλαβε και ξεκίνησε και αυτός τη δουλειά του. Χοντρές ψιχάλες πάλευαν με το δυνατό αέρα για να πέσουν στη γη και νικούσαν. Ο γέρος κουμπώθηκε σφιχτά στο πανωφόρι του ξυπνώντας από τις σκέψεις του και ετοιμάστηκε να γυρίσει.\n\nΌμως κάτι διέκρινε στη φουρτουνιασμένη θάλασσα· ένα καράβι. Ένα καράβι που πιθανότατα είχε χάσει το δρόμο του, ένα καράβι που πήγαινε ολοταχώς στα βράχια στις άκρες του νησιού, ένα καράβι γεμάτο ανθρώπινες ψυχές...\n\nΜε βήματα ασυνήθιστα ταχιά για την ηλικία του έφτασε στο φάρο και άναψε μια φωτιά με ότι βρήκε. Χωρίς να διστάσει, άρχισε να βάζει κομμάτια από τα λιγοστά του έπιπλα για να φουντώσει. Και η φωτιά υπάκουσε. Ολοένα δυνάμωνε και έτρωγε αχόρταγα τα σπασμένα ξύλα, την κερματισμένη ζωή του γέρου.\n\nΤο θαύμα έγινε!\n\nΤο καράβι πρέπει να πρόσεξε το φως, κατάφερε να αλλάξει πορεία παρά τα δυνατά κύματα και προχωρούσε αργά προς την ασφάλεια. Τα μάτια του γέρου το ακολούθησαν ώσπου το αγκάλιασε το σκοτάδι της νύχτας.\n\nΗ φωτιά ωστόσο θέριευε και όλα γύρω ακολουθούσαν τον πένθιμο χορό της· η ξύλινη πόρτα δεν έλειπε από αυτό.\n\nΜα εκείνος δεν έδινε σημασία. Το χρέος του είχε γίνει και η καρδιά του ήταν γαλήνια και ευτυχισμένη· τα χείλη του το πρόδιδαν. ≪Ένας άνθρωπος είναι πάντα καλύτερος≫, ψιθύρισε.\n\nΤο πρωί βρήκαν ό,τι είχε απομείνει από τα πράγματα του φάρου, ενός γέρου και ενός μηχανήματος. Όλα σε μαύρο χρώμα. Κανείς δεν ήξερε για το καράβι, ούτε έμαθε ποτέ. ≪Ο τρελόγερος!≫ είπαν, ≪Δεν άντεξε να φύγει και έβαλε τέλος σε όλα≫.\n\nΜια Τρίτη οι εργάτες έφεραν καινούριο μηχάνημα. Το ανέβασαν στο φάρο και ύστερα έφυγαν. Πάνω στην πόρτα σε ένα λευκό χαρτί με καθαρογραμμένες λέξεις έγραφε:\n\n≪Από την Πέμπτη ο φάρος θα λειτουργεί κανονικά.\nΟ δήμαρχος≫.",

  "backstage": "Για αυτό το project, αφιέρωσα τις προσπάθειές μου στην Javascript Internationalization (i18n) και στην εφαρμογή τεχνικών modularization για την επαναχρησιμοποίηση στοιχείων του ιστότοπου, όπως η κεφαλίδα και το υποσέλιδο.\n\nΠαρά τη διαθεσιμότητα βιβλιοθηκών i18n, επέλεξα να αναπτύξω τον δικό μου κώδικα για να αποκτήσω μια βαθύτερη κατανόηση της διαδικασίας. Ακολουθώντας μαθήματα, προσαρμόζοντας, ξαναγράφοντας και προσθέτοντας κώδικα για να ταιριάζει στις απαιτήσεις του project, βελτίωσα την κατανόησή μου για τις εσωτερικές λειτουργίες της Javascript, τις αλληλεξαρτήσεις των functions και variables και τη σπουδαιότητα της ανάλυσης των προβλημάτων σε μικρότερα διαχειρίσιμα στοιχεία.\n\nΕπέλεξα το Bulma CSS framework επειδή είναι ελαφρύ και δεν περιλαμβάνει Javascript, καθιστώντας το πιο κατάλληλο για ένα τόσο μικρό έργο."
}
