{
  "switcherLanguage_el": "ΕΛ",
  "switcherLanguage_en": "EN",
  "nav-home": "home",
  "nav-story": "story",
  "nav-backstage": "backstage",

  "logoAlt": "The Old Man & the Lighthouse",

  "title-home": "The Old Man & the Lighthouse",
  "subtitle-home": "The story of a story",

  "title-story": "The Old Man & the Lighthouse",
  "subtitle-story": "A Short Story, by Sofia P.",

  "title-backstage": "The Old Man & the Lighthouse",
  "subtitle-backstage": "About the project",

  "home": "\"The Old Man and the Lighthouse\" is an award-winning short story penned by Sofia Papaspyrou for the \"4th Writing Contest for Poetry and Short Stories\" hosted by \"Enneada\" Magazine in 2007. Sofia's captivating narrative secured her the 2nd prize in the \"Short Stories\" category.\n\nIn a coastal village, an old lighthouse keeper faces the prospect of being replaced by a machine. This poignant story highlights the irreplaceable nature of human compassion and the profound impact one life can have in the face of progress.",

  "story": "The sun awakened from its evening slumber, gradually emerging from the sea and casting a golden hue upon it. Its radiant light spread throughout, dissolving the lingering shadows of the night.\n\nHaving completed another night's work, the weary old man finally found respite. With effort, he rose from his chair, stepped outside the lighthouse for a moment, and gazed out at the sea. \"How selfish she is,\" he thought, \"allowing nothing but her presence to grace the horizon!\"\n\nTruly, the indigo expanse of his beloved sea extended as far as his aged eyes could see, blending harmoniously with the azure sky above. The fishermen returned, their voices lifted in song, their nets teeming with fish, and the lanterns still ablaze. In the village, the women opened their windows, inviting the invigorating fragrance of life, sunlight, and salt into their homes. Nature stirred from its slumber, heralding the arrival of a beautiful day.\n\nYet, the tranquility of the moment was abruptly disrupted for the old man. A visitor approached, the mayor himself, whose rotund belly nearly brushed against him.\n\n\"Good morning, old man! And what a great morning this is. I bring news, and it's good news. Starting tomorrow, you can rest. Yes - yes! Your work here is complete. We will bring in a machine that requires no human touch. All the neighboring villages have one, and of course, we won't be left behind. Never! So, leave tomorrow, but worry not. Just across the street, old lady Tasia has prepared a room for you. Over there! Yes - yes, great, all is arranged.\"\n\n\"Progress, progress!\" the mayor hummed cheerfully as he departed, leaving the old man with tiny droplets of the sea in his eyes. Slowly, they trickled down the furrows of his weathered face. Slowly and steadily... they knew their way by now.\n\nThoughts raced through his mind. How could the lighthouse survive without a keeper? Could a boat sail without a fisherman? Could a house exist without inhabitants? What strange magic was this? He turned to look at his lighthouse... leave... leave from where? From his life? \"A human is always better,\" he whispered. One by one, he ascended the lighthouse steps, carrying an additional burden upon his stooped back. Collapsing onto his hard bed, he sought solace from his thoughts. Fortunately, sleep took pity on him and quickly carried him away. Friday dawned.\n\nThe mayor arrived early, accompanied by six or seven workers. They barged into the lighthouse, dismantling, altering, transporting, fitting. Everything was nearly ready, and the lighthouse would resume its normal operation the next day. With no ships waiting that night, no one would be inconvenienced by the temporary darkness after such a long time...\n\nLeft behind, the old man aimlessly wandered the beach like a lifeless puppet.\n\nNight fell as it did every day, punctual and unwavering. The moon rose swiftly over the sea, following the path her beloved walked earlier that morning, never catching up. She wept bitterly for the loss of the sun, forever eluding her, forever fleeing... perhaps one day, who knows? Her tears dispersed into the sky. The old man heard calling them stars once. But soon, clouds covered the stars, heralds of an impending summer storm. The wind understood and commenced its work. Heavy raindrops fought against the powerful gusts, determined to reach the earth. They emerged victorious. Clutching his coat tightly, the old man awakened from his reverie, preparing to depart.\n\nYet, amidst the tempestuous sea, he spotted a ship. A ship that had seemingly lost its way, hurtling towards the treacherous rocks on the island's edge. A ship carrying countless souls...\n\nWith uncharacteristic agility for his age, he rushed to the lighthouse and ignited a fire using whatever he could find. Without hesitation, he sacrificed his meager furniture, feeding the flames. The fire responded, growing stronger, voraciously consuming the broken wood, the fragments of the old man's life.\n\nA miracle occurred!\n\nThe ship must have spotted the light, altering its course despite the raging waves, slowly navigating towards safety. The old man's eyes followed its progress until it vanished into the depths of the night.\n\nMeanwhile, the fire raged on, its mournful dance engulfing everything in its path, including the wooden door.\n\nYet, the old man cared not. His debt was repaid, and his heart found peace and contentment, his lips betraying his sentiment. \"A human is always better,\" he whispered.\n\nCome morning, what remained of the lighthouse lay in ruins, along with the old man and the machine. All were cloaked in black. No one knew of the ship, nor ever would. \"The deranged old man!\" they exclaimed. \"He couldn't bear to leave and brought it all to an end.\"\n\nOne Tuesday, the workers installed a new machine. They carried it up to the lighthouse and departed. Above the door, a white paper with clear writing proclaimed:\n\n\"Starting Thursday, the lighthouse will resume normal operation.\nThe Mayor.\"",

  "backstage": "In this project, I dedicated my efforts to exploring Javascript Internationalization (i18n) and implementing modularization techniques for reusable website components like the header and footer.\n\nDespite the availability of pre-made i18n libraries, I chose to develop my own code to gain a deeper understanding of the process. By following tutorials, adapting, rewriting and adding code to suit my project's requirements, I enhanced my comprehension of Javascript's inner workings, the interdependencies of functions and variables, and the significance of breaking down problems into manageable components.\n\nI opted for the Bulma CSS framework because it's lightweight and doesn't include Javascript, making it a better fit for such a small project."
}
